INSERT INTO "user" ("login", "email", "fullName", "phone", "address", "companyName", "lastVisitDate", "password", "role", "avatarUrl", "createdAt")
VALUES
    ('panteleev', 'panteleev@gmail.com', 'Пантелеев Егор Евгеньевич', '+79123456789', 'г. Москва, ул. Примерная, д. 10, кв. 123', 'ООО Пример', NOW(), 'password123', 0, '/uploads/default/default.png', NOW()),
    ('ivanov', 'ivanov@example.com', 'Иванов Иван Иванович', '+79876543210', 'г. Санкт-Петербург, ул. Тестовая, д. 5, кв. 50', 'ИП Иванов', NOW(), 'qwerty', 0, '/uploads/default/default.png', NOW()),
    ('petrov', 'petrov@example.com', 'Петров Петр Петрович', '+79998887766', 'г. Екатеринбург, пр. Образцовый, д. 20, кв. 30', 'ООО Тест', NOW(), 'password1234', 0, '/uploads/default/default.png', NOW()),
    ('sidorov', 'sidorov@example.com', 'Сидоров Сидор Сидорович', '+79991112233', 'г. Новосибирск, пер. Уникальный, д. 15, кв. 25', 'ООО Новый Мир', NOW(), 'password4321', 0, '/uploads/default/default.png', NOW()),
    ('smirnov', 'smirnov@example.com', 'Смирнов Сергей Сергеевич', '+79994445566', 'г. Казань, ул. Особенная, д. 3, кв. 10', 'ИП Смирнов', NOW(), 'password4321', 0, '/uploads/default/default.png', NOW()),
    ('popov', 'popov@example.com', 'Попов Павел Павлович', '+79997778899', 'г. Ростов-на-Дону, пр. Необычный, д. 8, кв. 20', 'ООО Ростов-Медиа', NOW(), 'password5678', 0, '/uploads/default/default.png', NOW()),
    ('kuznetsov', 'kuznetsov@example.com', 'Кузнецов Константин Константинович', '+79990001122', 'г. Самара, ул. Удивительная, д. 12, кв. 15', 'ИП Кузнецов', NOW(), 'password9876', 0, '/uploads/default/default.png', NOW()),
    ('mikhailov', 'mikhailov@example.com', 'Михайлов Михаил Михайлович', '+79998882233', 'г. Уфа, пр. Чудесный, д. 4, кв. 5', 'ООО Мир Михайловых', NOW(), 'password3456', 0, '/uploads/default/default.png', NOW()),
    ('fedorov', 'fedorov@example.com', 'Федоров Федор Федорович', '+79995556677', 'г. Воронеж, ул. Удивительная, д. 6, кв. 8', 'ИП Федоров', NOW(), 'password7654', 0, '/uploads/default/default.png', NOW()),
    ('korolev', 'korolev@example.com', 'Королев Кирилл Кириллович', '+79994443322', 'г. Калининград, пр. Интересный, д. 3, кв. 7', 'ООО Калининград-Медиа', NOW(), 'password6789', 0, '/uploads/default/default.png', NOW());

-- Добавление демо-данных для таблицы "Application"
INSERT INTO "applications" ("comment", "createdAt", "cost", "status", "userId", "responsibleId")
VALUES
    ('Здравствуйте, заинтересовал ваш сервис, свяжитесь со мной, вот ссылка на материалы https://example.com', NOW(), 200, 'PENDING', 1, NULL),
    ('Прошу рассмотреть мою заявку на публикацию, готов предоставить дополнительные материалы по запросу.', NOW(), 150, 'PENDING', 2, NULL),
    ('Хочу заказать рекламу в вашем издании, пожалуйста, предложите варианты и стоимость.', NOW(), 100, 'PENDING', 3, NULL),
    ('Интересует возможность партнерства с вашим изданием для размещения статей о нашей компании.', NOW(), 300, 'PENDING', 4, NULL),
    ('Прошу рассмотреть мою заявку на публикацию, приложил необходимые материалы.', NOW(), 180, 'PENDING', 5, NULL),
    ('Хотелось бы обсудить возможности рекламы на вашей площадке, пожалуйста, свяжитесь со мной.', NOW(), 220, 'PENDING', 6, NULL),
    ('Пожалуйста, проконсультируйте меня относительно услуг вашего издания.', NOW(), 120, 'PENDING', 7, NULL),
    ('Интересуюсь услугами вашего издания, готов обсудить детали и стоимость.', NOW(), 250, 'PENDING', 8, NULL),
    ('Предлагаем сотрудничество в области рекламы, ждем вашего ответа.', NOW(), 280, 'PENDING', 9, NULL),
    ('Здравствуйте, готовы рассмотреть предложения о сотрудничестве свашим изданием, свяжитесь, пожалуйста, для обсуждения деталей.', NOW(), 230, 'PENDING', 10, NULL);

-- Добавление демо-данных для таблицы "Publication"
INSERT INTO "publications" ("name", "description", "link", "cost", "imageUrl")
VALUES
('Getbrand', 'Getbrand - издание, специализирующееся на рекламе брендов и продуктов. Предлагает широкий спектр услуг для вашего бизнеса.', 'https://getbrand.com', 150, NULL),
('RusOutdoor', 'RusOutdoor - популярное рекламное издание, специализирующееся на наружной рекламе в России. Предоставляет эффективные решения для привлечения внимания к вашему бренду.', 'https://rusoutdoor.ru', 200, NULL),
('MediaTrend', 'MediaTrend - издание, освещающее современные тенденции в медиа-индустрии и рекламе. Предлагает аналитические обзоры и эксклюзивные материалы о трендах рекламного рынка.', 'https://mediatrend.com', 100, NULL),
('AdWeek', 'AdWeek - авторитетное издание, следящее за инновациями и тенденциями в мировой рекламной индустрии. Предлагает актуальные новости, интервью и обзоры кампаний.', 'https://adweek.com', 180, NULL),
('MarketingProfs', 'MarketingProfs - ресурс для маркетологов, предлагающий советы, инструменты и ресурсы для эффективного маркетинга. Публикует экспертные статьи и исследования.', 'https://marketingprofs.com', 220, NULL),
('HBR', 'Harvard Business Review - авторитетное издание, посвященное стратегии, инновациям и лидерству в бизнесе. Публикует статьи от ведущих экспертов и практиков.', 'https://hbr.org', 120, NULL),
('Campaign', 'Campaign - международное издание, специализирующееся на рекламе и маркетинге. Предлагает аналитику, новости и кейсы успешных кампаний.', 'https://campaignlive.com', 250, NULL),
('The Drum', 'The Drum - медиаплатформа, объединяющая маркетологов и рекламщиков. Публикует новости, статьи и мнения о текущих событиях и тенденциях в индустрии.', 'https://thedrum.com', 280, NULL),
('BizReport', 'BizReport - онлайн-ресурс, предлагающий новости, обзоры и аналитику в области маркетинга, рекламы и коммуникаций.', 'https://bizreport.com', 230, NULL),
('Marketing Dive', 'Marketing Dive - новостной портал, следящий за событиями в мире маркетинга и рекламы. Публикует обзоры кампаний, статьи и аналитику.', 'https://marketingdive.com', 300, NULL);

-- Связывание заявок с изданиями через таблицу "ApplicationPublications"
INSERT INTO "applicationPublications" ("applicationId", "publicationId", "publicationDate")
VALUES
(1, 1, NOW()),
(1, 2, NOW()),
(2, 3, NOW()),
(3, 4, NOW()),
(4, 5, NOW()),
(5, 6, NOW()),
(6, 7, NOW()),
(7, 8, NOW()),
(8, 9, NOW()),
(9, 10, NOW());

-- Добавление демо-данных для таблицы "Cart"
INSERT INTO "cart" ("itemId", "type", "itemDate", "userId")
VALUES
(1, 1, '2024-05-19', 1),
(2, 2, '2024-05-20', 2),
(3, 1, '2024-05-21', 3),
(4, 2, '2024-05-22', 4),
(5, 1, '2024-05-23', 5),
(6, 2, '2024-05-24', 6),
(7, 1, '2024-05-25', 7),
(8, 2, '2024-05-26', 8),
(9, 1, '2024-05-27', 9),
(10, 2, '2024-05-28', 10);