import { ApplicationStatus } from '@prisma/client';

export const getMockPublications = () => {
  return [
    {
      name: 'Strategic Marketing Vision',
      description:
        "Журнал 'Strategic Marketing Vision' представляет собой источник вдохновения для маркетологов, стремящихся создать значимые и долгосрочные связи с клиентами. Мы предлагаем глубокие аналитические обзоры современных тенденций, стратегических подходов и инновационных идей, которые помогут вашему бренду выделиться на фоне конкурентов.",
      link: 'https://example.com/strategic-marketing-vision',
      cost: 2000,
    },
    {
      name: 'Brand Identity Evolution',
      description:
        "Журнал 'Brand Identity Evolution' - это исследование эволюции идентичности бренда в современном мире. Мы исследуем как бренды реагируют на изменяющиеся требования рынка, строят свои стратегии и создают узнаваемый образ. Подписывайтесь, чтобы узнать, как сделать ваш бренд еще более сильным и запоминающимся.",
      link: 'https://example.com/brand-identity-evolution',
      cost: 2200,
    },
    {
      name: 'Market Trends Navigator',
      description:
        "Журнал 'Market Trends Navigator' помогает навигировать по сложному миру маркетинговых тенденций. Мы предоставляем всесторонний анализ ключевых факторов, определяющих развитие рынка, и помогаем бизнесам понять, как эти тенденции могут повлиять на их стратегии. Наша миссия - помочь вам принимать обоснованные решения и успешно адаптироваться к изменяющимся условиям.",
      link: 'https://example.com/market-trends-navigator',
      cost: 2100,
    },
    {
      name: 'Consumer Behavior Chronicles',
      description:
        "Журнал 'Consumer Behavior Chronicles' предлагает увлекательное путешествие в мир поведенческой экономики и анализа потребительского поведения. Мы исследуем, что заставляет потребителей принимать решения, как формируются и меняются их предпочтения, и как бренды могут использовать эту информацию для создания эффективных маркетинговых стратегий.",
      link: 'https://example.com/consumer-behavior-chronicles',
      cost: 2300,
    },
    {
      name: 'Digital Marketing Insights Digest',
      description:
        "Журнал 'Digital Marketing Insights Digest' предлагает свежие и перспективные взгляды на мир цифрового маркетинга. Мы рассматриваем последние технологические инновации, стратегические подходы и лучшие практики в сфере цифрового маркетинга. Подписывайтесь, чтобы оставаться в курсе последних трендов и получать рекомендации от ведущих экспертов отрасли.",
      link: 'https://example.com/digital-marketing-insights-digest',
      cost: 2400,
    },
    {
      name: 'Brand Storytelling Quarterly',
      description:
        "Журнал 'Brand Storytelling Quarterly' посвящен искусству создания убедительных историй бренда. Мы анализируем, какие истории резонируют с аудиторией, как они воздействуют на восприятие бренда и какие стратегии помогают брендам выделиться на фоне шума рынка.",
      link: 'https://example.com/brand-storytelling-quarterly',
      cost: 2500,
    },
    {
      name: 'Advertising Creativity Chronicles',
      description:
        "Журнал 'Advertising Creativity Chronicles' предлагает вдохновение и инсайты для творческих маркетологов. Мы исследуем лучшие практики в области творчества, анализируем успешные кейсы и делимся советами, как создавать запоминающиеся и эффективные рекламные кампании.",
      link: 'https://example.com/advertising-creativity-chronicles',
      cost: 2600,
    },
    {
      name: 'Marketing Metrics Quarterly Review',
      description:
        "Журнал 'Marketing Metrics Quarterly Review' предлагает глубокий анализ ключевых маркетинговых метрик и их влияния на бизнес. Мы рассматриваем показатели эффективности рекламы, конверсии, вовлеченности аудитории и другие важные показатели, помогая брендам оптимизировать свои стратегии и достигать лучших результатов.",
      link: 'https://example.com/marketing-metrics-quarterly-review',
      cost: 2700,
    },
    {
      name: 'Brand Positioning Playbook',
      description:
        "Журнал 'Brand Positioning Playbook' предлагает практические руководства и инсайты для эффективного позиционирования бренда на рынке. Мы анализируем конкурентные преимущества, целевую аудиторию и каналы коммуникации, помогая брендам создать уникальное и запоминающееся положение.",
      link: 'https://example.com/brand-positioning-playbook',
      cost: 2800,
    },
    {
      name: 'Creative Brand Campaigns Review',
      description:
        "Журнал 'Creative Brand Campaigns Review' представляет собой обзор самых креативных и вдохновляющих рекламных кампаний брендов со всего мира. Мы анализируем успешные стратегии, креативные подходы и воздействие кампаний на аудиторию, помогая маркетологам научиться создавать меморабельные и результативные рекламные кампании.",
      link: 'https://example.com/creative-brand-campaigns-review',
      cost: 2900,
    },
    {
      name: 'Marketing Psychology Insights',
      description:
        "Журнал 'Marketing Psychology Insights' исследует психологические аспекты потребительского поведения и их применение в маркетинге. Мы анализируем мотивации, влияние эмоций и психологические триггеры, помогая брендам создавать эмоциональные связи с аудиторией и увеличивать конверсию.",
      link: 'https://example.com/marketing-psychology-insights',
      cost: 3000,
    },
    {
      name: 'Digital Advertising Trends Report',
      description:
        "Журнал 'Digital Advertising Trends Report' представляет собой комплексный обзор последних тенденций в цифровой рекламе. Мы анализируем новые платформы, форматы и стратегии, которые определяют будущее цифровой рекламы, помогая маркетологам оставаться впереди конкурентов.",
      link: 'https://example.com/digital-advertising-trends-report',
      cost: 3100,
    },
    {
      name: 'Brand Loyalty Gazette',
      description:
        "Журнал 'Brand Loyalty Gazette' рассматривает стратегии укрепления лояльности потребителей и создания долгосрочных отношений с брендом. Мы анализируем программы лояльности, методы вовлечения аудитории и инновационные подходы, помогая брендам выстроить сильные и долгосрочные отношения с клиентами.",
      link: 'https://example.com/brand-loyalty-gazette',
      cost: 3200,
    },
    {
      name: 'Marketing Automation Insights',
      description:
        "Журнал 'Marketing Automation Insights' исследует возможности автоматизации маркетинга для оптимизации процессов и увеличения эффективности кампаний. Мы рассматриваем лучшие практики внедрения автоматизированных решений, анализируем новые технологии и делимся советами по использованию инструментов автоматизации.",
      link: 'https://example.com/marketing-automation-insights',
      cost: 3300,
    },
    {
      name: 'Las Vegas',
      description:
        "Журнал 'Las Vegas' рассматривает стратегии укрепления лояльности потребителей и создания долгосрочных отношений с брендом. Мы анализируем программы лояльности, методы вовлечения аудитории и инновационные подходы, помогая брендам выстроить сильные и долгосрочные отношения с клиентами.",
      link: 'https://example.com/brand-loyalty-gazette',
      cost: 3200,
    },
  ];
};

export const getMockApplications = () => {
  return [
    {
      name: 'ООО Магнит',
      comment:
        'Здравствуйте, заинтересовало ваше агентство. Хотелось бы узнать больше о ваших услугах и возможностях сотрудничества. Буду рад получить подробную информацию о вашем агентстве и условиях работы. Пожалуйста, свяжитесь со мной для обсуждения деталей.',
      email: 'user1@example.com',
      cost: 1000,
      status: ApplicationStatus.PENDING,
      userId: 2,
    },
    {
      name: 'ООО Роснефть',
      comment:
        'Здравствуйте, свяжитесь со мной. Хочу обсудить возможное сотрудничество с вашим агентством. Меня заинтересовали ваши услуги и результаты работы. Готов обсудить дальнейшие шаги и сотрудничество с вашей командой. Просьба оставить контактные данные для связи.',
      email: 'user2@example.com',
      cost: 1200,
      status: ApplicationStatus.PENDING,
      userId: 2,
    },
    {
      name: 'ОАО Газпром',
      comment:
        'Здравствуйте, заинтересовало ваше агентство. Хотелось бы узнать больше о ваших услугах и возможностях сотрудничества. Буду рад получить подробную информацию о вашем агентстве и условиях работы. Пожалуйста, свяжитесь со мной для обсуждения деталей.',
      email: 'user3@example.com',
      cost: 800,
      status: ApplicationStatus.PENDING,
      userId: 24,
    },
    {
      name: 'ЗАО Лукойл',
      comment:
        'Здравствуйте, свяжитесь со мной. Хочу обсудить возможное сотрудничество с вашим агентством. Меня заинтересовали ваши услуги и результаты работы. Готов обсудить дальнейшие шаги и сотрудничество с вашей командой. Просьба оставить контактные данные для связи.',
      email: 'user4@example.com',
      cost: 1500,
      status: ApplicationStatus.PENDING,
      userId: 35,
    },
    {
      name: 'ИП Рога и копыта',
      comment:
        'Здравствуйте, заинтересовало ваше агентство. Хотелось бы узнать больше о ваших услугах и возможностях сотрудничества. Буду рад получить подробную информацию о вашем агентстве и условиях работы. Пожалуйста, свяжитесь со мной для обсуждения деталей.',
      email: 'user5@example.com',
      cost: 900,
      status: ApplicationStatus.PENDING,
      userId: 18,
    },
    {
      name: 'ООО Газпромнефть',
      comment:
        'Здравствуйте, свяжитесь со мной. Хочу обсудить возможное сотрудничество с вашим агентством. Меня заинтересовали ваши услуги и результаты работы. Готов обсудить дальнейшие шаги и сотрудничество с вашей командой. Просьба оставить контактные данные для связи.',
      email: 'user6@example.com',
      cost: 1100,
      status: ApplicationStatus.PENDING,
      userId: 40,
    },
    {
      name: 'ИП Петров Иван Иванович',
      comment:
        'Здравствуйте, заинтересовало ваше агентство. Хотелось бы узнать больше о ваших услугах и возможностях сотрудничества. Буду рад получить подробную информацию о вашем агентстве и условиях работы. Пожалуйста, свяжитесь со мной для обсуждения деталей.',
      email: 'user7@example.com',
      cost: 950,
      status: ApplicationStatus.PENDING,
      userId: 13,
    },
    {
      name: 'ООО Газпром',
      comment:
        'Здравствуйте, свяжитесь со мной. Хочу обсудить возможное сотрудничество с вашим агентством. Меня заинтересовали ваши услуги и результаты работы. Готов обсудить дальнейшие шаги и сотрудничество с вашей командой. Просьба оставить контактные данные для связи.',
      email: 'user8@example.com',
      cost: 1300,
      status: ApplicationStatus.PENDING,
      userId: 26,
    },
    {
      name: 'ООО Роснефть',
      comment:
        'Здравствуйте, свяжитесь со мной. Хочу обсудить возможное сотрудничество с вашим агентством. Меня заинтересовали ваши услуги и результаты работы. Готов обсудить дальнейшие шаги и сотрудничество с вашей командой. Просьба оставить контактные данные для связи.',
      email: 'user10@example.com',
      cost: 1400,
      status: ApplicationStatus.PENDING,
      userId: 29,
    },
    {
      name: 'ИП Иванов Иван Иванович',
      comment:
        'Здравствуйте, заинтересовало ваше агентство. Хотелось бы узнать больше о ваших услугах и возможностях сотрудничества. Буду рад получить подробную информацию о вашем агентстве и условиях работы. Пожалуйста, свяжитесь со мной для обсуждения деталей.',
      email: 'user11@example.com',
      cost: 1100,
      status: ApplicationStatus.PENDING,
      userId: 9,
    },
    {
      name: 'ОАО Газпром',
      comment:
        'Здравствуйте, свяжитесь со мной. Хочу обсудить возможное сотрудничество с вашим агентством. Меня заинтересовали ваши услуги и результаты работы. Готов обсудить дальнейшие шаги и сотрудничество с вашей командой. Просьба оставить контактные данные для связи.',
      email: 'user12@example.com',
      cost: 1300,
      status: ApplicationStatus.PENDING,
      userId: 19,
    },
    {
      name: 'ИП Петров Петр Петрович',
      comment:
        'Здравствуйте, заинтересовало ваше агентство. Хотелось бы узнать больше о ваших услугах и возможностях сотрудничества. Буду рад получить подробную информацию о вашем агентстве и условиях работы. Пожалуйста, свяжитесь со мной для обсуждения деталей.',
      email: 'user13@example.com',
      cost: 1050,
      status: ApplicationStatus.PENDING,
      userId: 14,
    },
    {
      name: 'ИП Васильев Иван Васильевич',
      comment:
        'Здравствуйте, заинтересовало ваше агентство. Хотелось бы узнать больше о ваших услугах и возможностях сотрудничества. Буду рад получить подробную информацию о вашем агентстве и условиях работы. Пожалуйста, свяжитесь со мной для обсуждения деталей.',
      email: 'user14@example.com',
      cost: 950,
      status: ApplicationStatus.PENDING,
      userId: 25,
    },
    {
      name: 'ООО Лукойл',
      comment:
        'Здравствуйте, свяжитесь со мной. Хочу обсудить возможное сотрудничество с вашим агентством. Меня заинтересовали ваши услуги и результаты работы. Готов обсудить дальнейшие шаги и сотрудничество с вашей командой. Просьба оставить контактные данные для связи.',
      email: 'user15@example.com',
      cost: 1150,
      status: ApplicationStatus.PENDING,
      userId: 22,
    },
    {
      name: 'ООО Роснефть',
      comment:
        'Здравствуйте, свяжитесь со мной. Хочу обсудить возможное сотрудничество с вашим агентством. Меня заинтересовали ваши услуги и результаты работы. Готов обсудить дальнейшие шаги и сотрудничество с вашей командой. Просьба оставить контактные данные для связи.',
      email: 'user16@example.com',
      cost: 1250,
      status: ApplicationStatus.PENDING,
      userId: 33,
    },
  ];
};

export const getMockApplicationPublications = () => {
  return [
    {
      applicationId: 1,
      publicationId: 1,
      publicationDate: '2024-03-20',
    },
    {
      applicationId: 2,
      publicationId: 2,
      publicationDate: '2024-03-20',
    },
    {
      applicationId: 3,
      publicationId: 3,
      publicationDate: '2024-03-20',
    },
    {
      applicationId: 4,
      publicationId: 4,
      publicationDate: '2024-03-20',
    },
    {
      applicationId: 5,
      publicationId: 5,
      publicationDate: '2024-03-20',
    },
    {
      applicationId: 6,
      publicationId: 6,
      publicationDate: '2024-03-20',
    },
    {
      applicationId: 7,
      publicationId: 7,
      publicationDate: '2024-03-20',
    },
    {
      applicationId: 8,
      publicationId: 8,
      publicationDate: '2024-03-20',
    },
    {
      applicationId: 9,
      publicationId: 9,
      publicationDate: '2024-03-20',
    },
    {
      applicationId: 10,
      publicationId: 10,
      publicationDate: '2024-03-20',
    },
    {
      applicationId: 11,
      publicationId: 11,
      publicationDate: '2024-03-20',
    },
    {
      applicationId: 12,
      publicationId: 12,
      publicationDate: '2024-03-20',
    },
    {
      applicationId: 13,
      publicationId: 13,
      publicationDate: '2024-03-20',
    },
    {
      applicationId: 14,
      publicationId: 14,
      publicationDate: '2024-03-20',
    },
    {
      applicationId: 15,
      publicationId: 15,
      publicationDate: '2024-03-20',
    },
  ];
};
